---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.GradingInSamePhase
source: html/876f8db3-782b-9b06-cfd0-df07e3894179.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.GradingInSamePhase Property

The Surface being Graded was created in the current Phase. Grading it will result in it being created and destroyed in the same Phase.

## Syntax (C#)
```csharp
public static FailureDefinitionId GradingInSamePhase { get; }
```